app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.last
    respond_to do |format|
      if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "articles" ("created_at", "updated_at", "title", "body", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2021-09-14 15:06:01.300629"], ["updated_at", "2021-09-14 15:06:01.300629"], ["title", "sdfgh"], ["body", "dgfhjkl;"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = $1, "body" = $2 WHERE "articles"."id" = $3  [["updated_at", "2021-09-14 11:16:50.702955"], ["body", "Ali Ahmed is a Senior Developer of our current time, in Dev House. "], ["id", 4]]